# eleman işlemleri

In [1]:
import numpy as np
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [4]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [10]:
sozluk

{'var1': array([6, 9, 0, 2, 2]),
 'var2': array([0, 7, 2, 9, 5]),
 'var3': array([6, 2, 0, 9, 1])}

In [12]:
import pandas as pd
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     6     0     6
1     9     7     2
2     0     2     0
3     2     9     9
4     2     5     1

In [13]:
df[0:1]

   var1  var2  var3
0     6     0     6

In [14]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.index =["a","b","c","d","e"]
df

   var1  var2  var3
a     6     0     6
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [18]:
df["c":"e"]

   var1  var2  var3
c     0     2     0
d     2     9     9
e     2     5     1

In [19]:
#silme işlemi

In [20]:
df.drop("a",axis =0)

   var1  var2  var3
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [21]:
df

   var1  var2  var3
a     6     0     6
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [22]:
# a nın silindiği dataframe i yeni df olarak tanımlamak istersem;

In [25]:
df.drop("a",axis =0, inplace = True)
df
#inplace=True : kalıcı değişiklik yapmamızı sağlıyor
#axis=satır yada sütun ifade ediyor

   var1  var2  var3
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [26]:
#fancy

In [27]:
l = ["c","e"]
l

['c', 'e']

In [28]:
df.drop(l, axis=0)

   var1  var2  var3
b     9     7     2
d     2     9     9

In [29]:
#değişkenler için

In [31]:
df

   var1  var2  var3
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [30]:
"var1" in df

True

In [32]:
l = ["var1","var4","var2"]

In [33]:
for i in l:
    print(i in df)

True
False
True

In [34]:
df

   var1  var2  var3
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [35]:
df["var1"]

b    9
c    0
d    2
e    2
Name: var1, dtype: int32

In [37]:
df["var4"] = df["var1"]/df["var2"]
df

   var1  var2  var3      var4
b     9     7     2  1.285714
c     0     2     0  0.000000
d     2     9     9  0.222222
e     2     5     1  0.400000

In [38]:
#değişken silmek

In [39]:
df.drop("var4", axis=1)

   var1  var2  var3
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [40]:
df

   var1  var2  var3      var4
b     9     7     2  1.285714
c     0     2     0  0.000000
d     2     9     9  0.222222
e     2     5     1  0.400000

In [41]:
df.drop("var4",axis=1, inplace =True)
df

   var1  var2  var3
b     9     7     2
c     0     2     0
d     2     9     9
e     2     5     1

In [43]:
l = ["var1","var2"]

In [45]:
df.drop(l,axis=1)

   var3
b     2
c     0
d     9
e     1